Merge branch 'beta'
